CSI API ETABS v1
cFrameObj.SetOutputStations Method
 Assigns frame object output station data.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOutputStations(
	string Name,
	int MyType,
	double MaxSegSize,
	int MinSections,
	bool NoOutPutAndDesignAtElementEnds = false,
	bool NoOutPutAndDesignAtPointLoads = false,
	eItemType ItemType = eItemType.Objects
)
Function SetOutputStations (
	Name As String,
	MyType As Integer,
	MaxSegSize As Double,
	MinSections As Integer,
	Optional NoOutPutAndDesignAtElementEnds As Boolean = false,
	Optional NoOutPutAndDesignAtPointLoads As Boolean = false,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim MyType As Integer
Dim MaxSegSize As Double
Dim MinSections As Integer
Dim NoOutPutAndDesignAtElementEnds As Boolean
Dim NoOutPutAndDesignAtPointLoads As Boolean
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetOutputStations(Name,
	MyType, MaxSegSize, MinSections,
	NoOutPutAndDesignAtElementEnds,
	NoOutPutAndDesignAtPointLoads,
	ItemType)
int SetOutputStations(
	String^ Name,
	int MyType,
	double MaxSegSize,
	int MinSections,
	bool NoOutPutAndDesignAtElementEnds = false,
	bool NoOutPutAndDesignAtPointLoads = false,
	eItemType ItemType = eItemType::Objects
)
abstract SetOutputStations :
        Name : string *
        MyType : int *
        MaxSegSize : float *
        MinSections : int *
        ?NoOutPutAndDesignAtElementEnds : bool *
        ?NoOutPutAndDesignAtPointLoads : bool *
        ?ItemType : eItemType
(* Defaults:
        let _NoOutPutAndDesignAtElementEnds = defaultArg NoOutPutAndDesignAtElementEnds false
        let _NoOutPutAndDesignAtPointLoads = defaultArg NoOutPutAndDesignAtPointLoads false
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
MyType
Type: System.Int32
 This is 1 or 2, indicating how the output stations are specified.
maximum segment size, that is, maximum station spacing
minimum number of stations
MaxSegSize
Type: System.Double
 The maximum segment size, that is, the maximum station spacing. This item applies only when MyType = 1. [L]
MinSections
Type: System.Int32
 The minimum number of stations. This item applies only when MyType = 2.
NoOutPutAndDesignAtElementEnds (Optional)
Type: System.Boolean
 If this item is True, no additional output stations are added at the ends of line elements when the frame object is internally meshed. In ETABS, this item will always be False
NoOutPutAndDesignAtPointLoads (Optional)
Type: System.Boolean
 If this item is True, no additional output stations are added at point load locations. In ETABS, this item will always be False
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the data is successfully assigned, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'assign frame output station data
   ret = SapModel.FrameObj.SetOutputStations("15", 1, 18, 0)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace